Repository: bemot/gogandmagog
Catalog: translation/translation-omegat.tmx
Source language: en_us
Languages: uk

source: Okay, with that in mind, let's go back to the book of Ezekiel.
uk: Гаразд, маючи це на увазі, давайте повернемося до книги Єзекіїля.

source: On the, it's not just gonna be anything goes.
uk: З іншого боку, це не просто так, що все піде.

source: One apostle will judge each tribe.
uk: Один апостол судитиме кожне плем’я.

source: Otherwise, I guarantee you, if you just say, well, I'm gonna freestyle and just read what I feel like, you're just gonna keep ending up in Psalms, Proverbs, Red Letters, 1st and 2nd Timothy.
uk: Інакше я гарантую вам, що якщо ви просто скажете: «Я буду вільно читати, що мені хочеться», ви будете продовжувати потрапляти до Псалмів, Приповістей, Червоних листів, 1-го та 2-го Тимофія.

source: People are at rest, verse 11.
uk: Люди спочивають, вірш 11.

source: People from Persia, that's representing people from, you know, Iran or that area, Africa, just Europe, Gomer and Magog, just people from all over the world, okay, are gonna be coming.
uk: Люди з Персії, які представляють людей з, знаєте, Ірану чи того регіону, Африки, просто Європи, Гомер і Магог, просто люди з усього світу, гаразд, приїдуть.

source: People have made this complicated, but it's all making sense, it's all adding up.
uk: Люди зробили це складним, але все це має сенс, все додається.

source: People throughout the Old Testament and the great men of the Old Testament like Abraham, Isaac, and Jacob, they called upon the name of the Lord, they were saved.
uk: Люди в усьому Старому Завіті та великі люди Старого Завіту, такі як Авраам, Ісак і Яків, вони закликали ім’я Господа, вони були врятовані.

source: Perfect, right?
uk: Ідеально, правда?

source: Really about 15 minutes a day.
uk: Насправді близько 15 хвилин на день.

source: Really, just a quick couple of verses to describe these big events.
uk: Дійсно, просто кілька віршів, щоб описати ці великі події.

source: Remember, all the swords have been beaten into plowshares, the spears into pruning.
uk: Пам’ятайте, що всі мечі перекуті на лемеші, а списи – на січі.

source: Right?
uk: правильно?

source: Satan comes out, he deceives the nations.
uk: Сатана виходить, він обманює народи.

source: See, I'm a bad reader, listen to it.
uk: Бачите, я погано читаю, послухайте.

source: Show me a marathon runner who doesn't have a training plan and who doesn't log their miles.
uk: Покажіть мені марафонця, який не має плану тренувань і не записує свої милі.

source: So I'd say he's going into the Four Quarters of the Earth, he's going all over the Earth and gathering these nations to the battle.
uk: Тож я б сказав, що він йде на Чотири Чверті Землі, він йде по всій Землі та збирає ці нації для битви.

source: So according to what we saw in Revelation, what was the timeline of events?
uk: Отже, згідно з тим, що ми бачили в Об’явленні, якою була хронологія подій?

source: So after the millennium, that's when the devil starts deceiving people.
uk: Отже, після тисячоліття, саме тоді диявол починає обманювати людей.

source: So all of that productivity of mankind, all of the brains that go into designing new weapons, you know what those are gonna go toward?
uk: Отже, вся ця продуктивність людства, весь мозок, який витрачається на розробку нової зброї, знаєте, на що вони підуть?

source: So all these people come and they gather against Jesus Christ and they gather against the saints and they wanna overthrow this thousand year reign of Christ and they don't even get to do battle because fire ends up raining from heaven and just destroying them all.
uk: Отже, всі ці люди приходять і збираються проти Ісуса Христа, і вони збираються проти святих, і вони хочуть повалити це тисячолітнє правління Христа, і вони навіть не можуть вступити в бій, тому що вогонь зрештою ллється з неба і просто знищує їх усіх.

source: So at that event of the rapture, all of the dead saints of all ages are going to be resurrected.
uk: Отже, під час піднесення піднесення всі померлі святі всіх віків воскреснуть.

source: So at the end of that thousand years of Jesus Christ ruling and reigning on this earth, there is going to be a group of people that rebel against Jesus Christ and they wanna come up against him.
uk: Отже, наприкінці тисячі років правління і правління Ісуса Христа на цій землі з’явиться група людей, які повстатимуть проти Ісуса Христа і захочуть виступити проти нього.

source: So basically when the devil goes out to deceive all these nations in the four quarters of the earth, he's gonna put this evil thought into their mind.
uk: Отже, по суті, коли диявол виходить обманювати всі ці народи на чотирьох чвертях землі, він вкладе цю злу думку в їхній розум.

source: So carve out that 15 minutes, carve out that 20 minutes and read your Bible.
uk: Тож виділіть ці 15 хвилин, виділіть ці 20 хвилин і читайте свою Біблію.

source: So during God's pouring out his wrath with the seven trumpets and the seven vials, the Bible specifically brings up, hey, people are still fornicating during that time.
uk: Отже, під час того, як Бог виливав Свій гнів за допомогою семи сурем і семи чаш, Біблія конкретно згадує, що люди все ще блудять у цей час.

source: So get that Bible reading plan, check it off.
uk: Тож візьміть цей план читання Біблії, позначте його.

source: So hail and hellfire comes down on them, and he says, I'll be known in the eyes of many nations, and they shall know that I'm the Lord when he does that.
uk: І впав на них град і пекельний вогонь, і він сказав: Я буду відомий в очах багатьох народів, і вони пізнають, що Я Господь, коли він це зробить.

source: So he wipes them out.
uk: Тож він їх витирає.

source: So he's busy reading all that devotional and then he's got his prayer of J-Bez over here and he's got with a lion in a pit on a snowy day over here and he's got the left behind series over here.
uk: Тож він зайнятий читанням усієї цієї молитви, а потім у нього тут є його молитва Джей-Без, і він тут із левом у ямі в сніжний день, і тут у нього є остання серія.

source: So he's reading a lot of spiritual things that are making him feel like I'm learning the Bible.
uk: Тож він читає багато духовних речей, які змушують його відчувати, ніби я вивчаю Біблію.

source: So he's taken to a valley where he sees people that have been dead for a long time.
uk: Тож його відвезли в долину, де він бачить людей, які вже давно мертві.

source: So here's the fire coming down from God out of heaven, but here it's a little more detail that after he causes confusion in their ranks, he's going to reign upon them hail stones and fire and brimstone from heaven, right?
uk: Отже, ось вогонь, що сходить від Бога з небес, але тут є трохи більше деталей, що після того, як він спричинить замішання в їхніх рядах, він збирається царювати на них градом, вогнем і сіркою з небес, чи не так?

source: So here's what's gonna happen.
uk: Отже, ось що станеться.

source: So if his body was still in the grave in Acts two, guess what, it's still in the grave right now as well.
uk: Отже, якщо його тіло все ще було в могилі у другій частині Дії, здогадайтеся що, воно все ще знаходиться в могилі прямо зараз.

source: So if you break open a bone, it's not dry on the inside.
uk: Отже, якщо ви зламаєте кістку, вона не суха всередині.

source: So in this scripture, we see mention of the millennial reign of Christ, the believers living and reigning with Christ for a thousand years.
uk: Отже, у цьому вірші ми бачимо згадку про тисячолітнє правління Христа, віруючі жили та царювали з Христом протягом тисячі років.

source: So in verse 11 of chapter 37, God starts to interpret what this means.
uk: Отже, у вірші 11 розділу 37 Бог починає пояснювати, що це означає.

source: So it gives you one verse and then it's just kind of blah, blah, blah, blah, blah, blah, blah, blah.
uk: Тож це дає вам один вірш, а потім це просто бла, бла, бла, бла, бла, бла, бла, бла.

source: So it makes no sense.
uk: Тому немає сенсу.

source: So it makes perfect sense that we read about Jerusalem being filled with unwalled villages.
uk: Тож цілком зрозуміло, що ми читаємо про те, що Єрусалим наповнений селами без стін.

source: So it says that they will come upon them and they wanna take their goods and steal from them and so forth.
uk: Тож там сказано, що вони натраплять на них і захочуть забрати їхнє майно, вкрасти у них і так далі.

source: So it says, I'll call for a sword against him throughout all my mountains, say to the Lord God, every man's sword shall be against his brother.
uk: Так сказано: Я покличу меча на нього по всіх моїх горах, скажи Господу Богу: Меч кожного на брата його!

source: So it's gonna be a time of great prosperity.
uk: Тож це буде час великого процвітання.

source: So it's pretty easy to see which of these two positions is right.
uk: Тому досить легко зрозуміти, яка з цих двох позицій є правильною.

source: So it's pretty silly to say, oh yeah, you know, that's 1948, you know, when the Israel became one nation, wrong.
uk: Тож досить безглуздо говорити, о так, знаєте, це 1948 рік, знаєте, коли Ізраїль став єдиною нацією, неправильно.

source: So let's keep going here.
uk: Тож продовжуймо.

source: So that actually makes perfect sense.
uk: Тож це насправді має сенс.

source: So that means the 12 tribes of Israel from the Old Testament are gonna come up out of their graves.
uk: Отже, це означає, що 12 племен Ізраїлю зі Старого Завіту встануть зі своїх могил.

source: So that's a signal to us when we're reading Revelation 20 that if we want more detail about the millennium, if we want more detail about Gog and Magog and this great battle to go back to the book of Ezekiel.
uk: Отже, коли ми читаємо Одкровення 20, це сигнал для нас, що якщо ми хочемо більше деталей про тисячоліття, якщо ми хочемо більше деталей про Гога і Магога та цю велику битву, повернемося до книги Єзекіїля.

source: So that's gonna be a beautiful, perfect time on this earth, but there are gonna be a lot of people at the end of that that are not satisfied with that.
uk: Тож це буде прекрасний, ідеальний час на цій землі, але наприкінці цього часу буде багато людей, які не будуть цим задоволені.

source: So that's what God's gonna do.
uk: Отже, це те, що Бог зробить.

source: So that's what's going on here.
uk: Отже, ось що тут відбувається.

source: So the ironic thing is that the Zionist pre-trib, TV preacher crowd, they think that the burning the weapons for seven years is the big proof that it happens when they say it happens at the beginning of the tribulation, right around the time of the rapture, because they think that the rapture takes place before the tribulation.
uk: Тож іронією є те, що натовп сіоністських предплемінників, телевізійних проповідників, вони вважають, що спалювання зброї протягом семи років є великим доказом того, що це сталося, коли вони кажуть, що це сталося на початку скорботи, прямо під час піднесення, тому що вони думають, що підхоплення відбувається перед скорботою.

source: So they have little dents, so you can get a discount.
uk: Тому на них маленькі вм'ятини, тому можна отримати знижку.

source: So they were still in Christ.
uk: Отже, вони все ще були у Христі.

source: So they're gonna have to come up with a battle plan.
uk: Тож їм доведеться розробити план бою.

source: So this is pointing us to end times Bible prophecy because there's gonna be a great resurrection in the end times, right?
uk: Отже, це вказує нам на біблійне пророцтво про кінець часів, тому що в останні часи буде велике воскресіння, чи не так?

source: So we don't wanna be children, we don't wanna be tossed to and fro with every wind of doctrine.
uk: Отже, ми не хочемо бути дітьми, ми не хочемо, щоб нас кидав туди-сюди кожен вітер доктрини.

source: So we have to understand that there's a time here that goes by.
uk: Тому ми повинні розуміти, що тут є час, який минає.

source: So we know what hail stones are.
uk: Отже, ми знаємо, що таке град.

source: So we need to make sure that we don't spend a bunch of time reading books about the Bible, that we actually take that 15 minutes a day, you know, take that 20 minutes a day or however long it takes you and read your Bible.
uk: Тож нам потрібно переконатися, що ми не витрачаємо купу часу на читання книжок про Біблію, що ми справді приділяємо ці 15 хвилин на день, ви знаєте, знайдіть ці 20 хвилин на день або скільки завгодно, щоб ви прочитали Біблія.

source: So what's going to happen is that when Jesus Christ comes in the clouds and the trumpet sounds at the rapture, the Bible says that dead in Christ shall rise first.
uk: Отже, що станеться так: коли Ісус Христос прийде на хмарах і пролунає сурма під час захоплення, Біблія каже, що мертві у Христі воскреснуть першими.

source: So what's the lesson that we can take away from this?
uk: Отже, який урок ми можемо винести з цього?

source: So when are they gonna be resurrected?
uk: Тож коли вони воскреснуть?

source: So when it's expired, that means the thousand years are over.
uk: Отже, коли він закінчився, це означає, що тисяча років минула.

source: So when the thousand years are expired, Satan's loosed out of his prison.
uk: Отже, коли тисяча років мине, Сатана звільниться зі своєї в’язниці.

source: So when you go into the millennium, you still have sinful people around.
uk: Отже, коли ви входите в тисячоліття, навколо вас все ще є грішні люди.

source: So where's the seven years to burn these weapons?
uk: То де ж сім років спалювати цю зброю?

source: So will I make my holy name known in the midst of my people Israel, and I will not let them pollute my holy name anymore, and that he then shall know that I am the Lord, the Holy One of Israel.
uk: І Я об’явлю Моє святе Ім’я серед народу Мого Ізраїля, і не дозволю їм більше зневажати Моє святе Ім’я, і він тоді пізнає, що Я Господь, Святий Ізраїлів.

source: Some people have a strange belief that they've already been resurrected, but of course that isn't true because if you remember in Acts chapter two when Peter's preaching, he said that David's sepulchre remains unto us until this day.
uk: Деякі люди мають дивну віру в те, що вони вже воскресли, але, звісно, це неправда, тому що якщо ви пам’ятаєте у другому розділі Дії, коли Петро проповідував, він сказав, що гробниця Давида залишається для нас до цього дня.

source: That could really pelt you.
uk: Це може вас справді вразити.

source: That crammed a lot of events just into a couple of verses.
uk: Це втиснуло багато подій лише в пару віршів.

source: That evil thought would never enter your mind.
uk: Ця зла думка ніколи не прийде тобі в голову.

source: That makes no sense, makes zero sense.
uk: Це не має сенсу, не має сенсу.

source: That makes no sense.
uk: Це не має сенсу.

source: That makes perfect sense if it's after the millennium like Revelation 20 said, but according to Tim LaHaye left behind, TV preachers, the prophecy books at the Christian bookstore, it makes zero sense.
uk: Це має цілком сенс, якщо це після тисячоліття, як сказано в Одкровенні 20, але, за словами Тіма ЛаХея, залишені позаду, телевізійні проповідники, книги пророцтв у християнському книжковому магазині, це не має сенсу.

source: That makes sense, it fits, right?
uk: Це має сенс, це підходить, чи не так?

source: That probably takes a few years.
uk: Ймовірно, це займе кілька років.

source: That was the only detail.
uk: Це була єдина деталь.

source: That way you know that you're getting everything God has for you.
uk: Таким чином ви знаєте, що отримуєте все, що Бог має для вас.

source: That's a good rule of thumb.
uk: Це гарне емпіричне правило.

source: That's gonna be the thought process.
uk: Це буде процес мислення.

source: That's gonna take some time.
uk: Це займе деякий час.

source: That's just the people that were saved after the time of Christ.
uk: Це просто люди, які були врятовані після часів Христа.

source: That's the only way anybody could ever be saved is through the blood of Jesus Christ.
uk: Це єдиний спосіб, яким хтось міг би врятуватися, це кров Ісуса Христа.

source: That's what it, here's the proof he's only hitting the highlights.
uk: Ось і все, ось доказ того, що він вражає лише найяскравіші моменти.

source: The Bible said that's after the 1,000 year reign of Christ.
uk: У Біблії сказано, що це після 1000-річного правління Христа.

source: The Bible says during that time, a little child would be able to just play with a snake out in the wild and not have to be worried about anything.
uk: У той час Біблія говорить: Маленька дитина зможе просто грати зі змією на волі І не доведеться ні про що турбуватися.

source: The Bible says here that Gog and Magog and all these other nations of Libya, Ethiopia, Persia, Gomer, Togomer, all these different nations that are gonna come against Israel, it says that they're gonna think an evil thought in their mind.
uk: У Біблії сказано, що Гог і Магог, і всі ці інші народи Лівії, Ефіопії, Персії, Гомера, Тогомера, всі ці різні народи, які збираються виступити проти Ізраїлю, сказано, що вони будуть думати про злу думку в своєму розумі.

source: The Bible says in verse number seven, and when the thousand years are expired, Satan shall be loosed out of his prison and shall go out to deceive the nations which are in the four quarters of the earth, Gog and Magog, to gather them together to battle, the number of whom is as the sand of the sea.
uk: У сьомому вірші Біблії сказано, що коли закінчиться тисяча років, Сатана буде звільнений зі своєї в’язниці і вийде обманювати народи, які знаходяться на чотирьох сторонах землі, Гога і Магога, щоб зібрати їх разом до бою, число яких, як пісок морський.

source: The Bible says neither shall they learn war anymore during the millennium because it's just not a thing.
uk: Біблія каже, що вони більше не навчаться війни протягом тисячоліття, тому що це просто не річ.

source: The Bible says they're gonna beat their swords into plowshares, they're gonna beat their spears into pruning hooks.
uk: У Біблії сказано, що вони перекують свої мечі на лемеші, а списи перекують на серпи.

source: The guns are all rusted and not working because nobody cares because it's just, they're not learning war anymore.
uk: Зброя заіржавіла й не працює, тому що нікого це не хвилює, бо просто вони більше не вчаться війни.

source: The leg bones connected to the foot bone.
uk: Кістки ніг з’єднані з кісткою стопи.

source: The only trump card that the other side's gonna pull out is what about burning those weapons for seven years?
uk: Єдиний козир, який інша сторона збирається витягти, це те, що спалювати цю зброю протягом семи років?

source: The practical application is that we need to read our Bibles and accept it for what it says and spend less time reading books about the Bible and spend more time reading the Bible itself.
uk: Практичне застосування полягає в тому, що нам потрібно читати нашу Біблію і приймати її так, як вона говорить, і витрачати менше часу на читання книг про Біблію, а більше часу на читання самої Біблії.

source: The same day there was a great white throne directly following there's a straight way, a non.
uk: Того ж дня був великий білий трон прямо за прямим шляхом, не.

source: Them bones, them bones, them dry bones.
uk: Ті кості, ті кості, ті сухі кості.

source: Then it says in verse number 14, therefore son of man prophesy and say unto God, thus sayeth the Lord God, in that day when my people of Israel dwelleth safely, shalt thou not know it, and thou shalt come from thy place out of the north parts, thou and many people with thee, all of them riding upon horses, a great company and a mighty army, and thou shalt come up against my people of Israel as a cloud to cover the land, it shall be in the latter days, and I will bring thee against my land, that the heathen may know me, when I shall be sanctified in thee, O God, before their eyes, thus sayeth the Lord God, art thou he of whom I've spoken in old time, by my servants the prophets of Israel, which prophesied in those days many years, that I would bring thee against them, and it shall come to pass at the same time when God shall come against the land of Israel, sayeth the Lord God, that my fury shall come up in my face, for in my jealousy, and in the fire of my wrath have I spoken, surely in that day there shall be a great shaking in the land of Israel, that sounds like some kind of an earthquake, right?
uk: Тоді сказано у вірші номер 14, отже, сину людський, пророкуй і скажи Богові: так говорить Господь Бог, того дня, коли мій народ із Ізраїлю житиме безпечно, ти не знатимеш цього, і ти вийдеш зі свого місця з північні частини, ти та багато людей з тобою, усі вони верхи на конях, велика група та могутнє військо, і ти підеш проти Мого народу Ізраїля, як хмара, щоб покрити землю, це буде в останньому днів, і приведу тебе на землю мою, щоб пізнали мене погани, коли я буду освячений в Тобі, о Боже, перед їхніми очима, так говорить Господь Бог, ти той, про кого я говорив у давнину час, Моїми слугами, Ізраїлевими пророками, які пророкували в ті дні багато років, що Я приведу тебе проти них, і це станеться того самого часу, коли Бог прийде на Ізраїлеву землю, говорить Господь Бог , що мій гнів вийде на моє обличчя, бо в ревнощах моїх і в полум’ї гніву мого я говорив, безсумнівно, того дня станеться велике потрясіння в землі Ізраїлю, що звучить як якесь землетрус, так?

source: Then there's an aftermath of the Battle of Gog and Magog where they clean up the battle, they bury the dead bodies, they gather up the weapons, and then sometime shortly thereafter, you have the great white throne judgment, the final judgment.
uk: Потім є наслідки битви при Ґогу та Магозі, де вони очищають битву, вони ховають тіла мертвих, вони збирають зброю, а потім незабаром після цього ви маєте великий суд над білим троном, остаточний суд.

source: Then they could rig them up to do some kind of a plowing of a field or something.
uk: Тоді вони могли б їх оснастити, щоб робити якусь оранку поля чи щось таке.

source: Then we had the battle of Gog and Magog.
uk: Потім у нас була битва Гога і Магога.

source: Then we had the great white throne and the new heaven and the new earth.
uk: Потім у нас був великий білий престол, нове небо і нова земля.

source: There are no bolts, no bars.
uk: Немає ні болтів, ні решіток.

source: There could never be another rebellion.
uk: Більше повстання не могло бути.

source: There is no excuse to not spend 15, 20 minutes in the Word of God every single day.
uk: Немає виправдання, щоб не витрачати 15, 20 хвилин на Слово Боже щодня.

source: There's actually moisture there.
uk: Там справді волога.

source: There's gonna be a thousand years of peace on earth.
uk: На землі буде тисяча років миру.

source: There's gonna be peace on earth, lions are gonna eat straw, they're not even gonna attack a human being.
uk: Буде мир на землі, леви будуть їсти солому, навіть на людину не нападуть.

source: There's not a lot of detail in that story.
uk: У цій історії не так багато деталей.

source: There's this one last battle, Gog and Magog, right?
uk: Це остання битва, Гог і Магог, чи не так?

source: Therefore prophesy and say unto them, thus sayeth the Lord God, behold, O my people, I'll open up your graves and cause you to come up out of your graves and bring you into the land of Israel.
uk: Тому пророкуй і скажи їм: так говорить Господь Бог: ось, народе мій, Я відкрию ваші гроби і виведу вас із ваших гробів, і приведу вас до Ізраїлевої землі.

source: These people are in an unwalled village, no bolt, no gate.
uk: Ці люди живуть у селі без стін, без засуву, без воріт.

source: These people are sitting ducks.
uk: Ці люди - сидячі качки.

source: These people are totally unprotected.
uk: Ці люди абсолютно незахищені.

source: These people don't even remember how to fight.
uk: Ці люди навіть не пам'ятають, як воювати.
